In [5]:
import pandas as pd
import numpy as np

In [20]:
from numpy.random import randn
np.random.seed(101)

In [43]:
df= pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [44]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [36]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [41]:
df[['W','Z']]

          W         Z
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [15]:
# Dataframe in pandas is a series by series operation.

In [40]:
#Create new column
df['K'] = df['W'] + df['Y']
df

          W         X         Y         Z         K
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
# Remove column in df
df.drop('A',axis=0,inplace=True)
df

          W         X         Y         Z         K
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [45]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [46]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [47]:
# Select a value based on row and col
df.loc['B','Y']

0.16690463609281317

In [48]:
# Select multiple values based on rows n cols.
df.loc[['A','B'],['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528

In [49]:
df.iloc[0:2,0:2]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528

In [50]:
df[df >0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [51]:
df[df['W'] > 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [55]:
#See only Y & Z columns after filter
df[df['W'] > 0][['Y','Z']]

          Y         Z
A -1.706086 -1.159119
C  0.638787  0.329646

In [58]:
df[(df['W']>0) & (df['Y'] <1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [59]:
# Reset index to default
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [64]:
newcol = 'MY SG VT TH IN'.split()
newcol

['MY', 'SG', 'VT', 'TH', 'IN']

In [70]:
df['Country']=newcol
df

                W         X         Y         Z Country
Country
MY       0.302665  1.693723 -1.706086 -1.159119      MY
SG      -0.134841  0.390528  0.166905  0.184502      SG
VT       0.807706  0.072960  0.638787  0.329646      VT
TH      -0.497104 -0.754070 -0.943406  0.484752      TH
IN      -0.116773  1.901755  0.238127  1.996652      IN

In [71]:
# Set new index
df.set_index('Country',inplace=True)
df

                W         X         Y         Z
Country
MY       0.302665  1.693723 -1.706086 -1.159119
SG      -0.134841  0.390528  0.166905  0.184502
VT       0.807706  0.072960  0.638787  0.329646
TH      -0.497104 -0.754070 -0.943406  0.484752
IN      -0.116773  1.901755  0.238127  1.996652

In [72]:
# Impute missing values during preprocessing using statistical methodologies (mean etc.)

In [73]:
newdf = df[df>0]
newdf

                W         X         Y         Z
Country
MY       0.302665  1.693723       NaN       NaN
SG            NaN  0.390528  0.166905  0.184502
VT       0.807706  0.072960  0.638787  0.329646
TH            NaN       NaN       NaN  0.484752
IN            NaN  1.901755  0.238127  1.996652

In [74]:
newdf.dropna()

                W        X         Y         Z
Country
VT       0.807706  0.07296  0.638787  0.329646

In [77]:
newdf.dropna(axis=1,thresh =2)

                W         X         Y         Z
Country
MY       0.302665  1.693723       NaN       NaN
SG            NaN  0.390528  0.166905  0.184502
VT       0.807706  0.072960  0.638787  0.329646
TH            NaN       NaN       NaN  0.484752
IN            NaN  1.901755  0.238127  1.996652

In [81]:
#Backfill (impute with value before) 
#Frontfill (impute with value after)
newdf.fillna(value='FILL VALUE')

                  W           X           Y           Z
Country
MY         0.302665     1.69372  FILL VALUE  FILL VALUE
SG       FILL VALUE    0.390528    0.166905    0.184502
VT         0.807706   0.0729597    0.638787    0.329646
TH       FILL VALUE  FILL VALUE  FILL VALUE    0.484752
IN       FILL VALUE     1.90175    0.238127     1.99665

In [83]:
#Impute with average value of the column/row
newdf.loc['SG'].fillna(value=newdf.loc['SG'].mean())

W    0.247311
X    0.390528
Y    0.166905
Z    0.184502
Name: SG, dtype: float64

In [84]:
newdf

                W         X         Y         Z
Country
MY       0.302665  1.693723       NaN       NaN
SG            NaN  0.390528  0.166905  0.184502
VT       0.807706  0.072960  0.638787  0.329646
TH            NaN       NaN       NaN  0.484752
IN            NaN  1.901755  0.238127  1.996652

In [92]:
# For Row operations always require .loc
newdf['J'] = [1,2,3,4,5]
#newdf.loc['CH'] = [1,2,3,4,]
newdf

ValueError: Length of values does not match length of index

## GroupBy

In [114]:
data = {
        'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Sam', 'Ema', 'Anna', 'Carl','Sarah', 'Viki'],
        'Sales' : [200,120,340,124,243,350],
        'Num Products' : [2,10,34,12,23,35]
}

In [115]:
df = pd.DataFrame(data)

In [116]:
df

  Company Person  Sales  Num Products
0    GOOG    Sam    200             2
1    GOOG    Ema    120            10
2    MSFT   Anna    340            34
3    MSFT   Carl    124            12
4      FB  Sarah    243            23
5      FB   Viki    350            35

In [117]:
df.groupby('Company').mean()

         Sales  Num Products
Company
FB       296.5          29.0
GOOG     160.0           6.0
MSFT     232.0          23.0

In [104]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [105]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [107]:
df.groupby('Company').sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [108]:
df.groupby('Company').min()

        Person  Sales
Company
FB       Sarah    243
GOOG       Ema    120
MSFT      Anna    124

In [109]:
df.groupby('Company').max()

        Person  Sales
Company
FB        Viki    350
GOOG       Sam    200
MSFT      Carl    340

In [121]:
# Stats info for a DF with the quartiles.
df.groupby('Company').describe().transpose()

Company                     FB        GOOG        MSFT
Sales        count    2.000000    2.000000    2.000000
             mean   296.500000  160.000000  232.000000
             std     75.660426   56.568542  152.735065
             min    243.000000  120.000000  124.000000
             25%    269.750000  140.000000  178.000000
             50%    296.500000  160.000000  232.000000
             75%    323.250000  180.000000  286.000000
             max    350.000000  200.000000  340.000000
Num Products count    2.000000    2.000000    2.000000
             mean    29.000000    6.000000   23.000000
             std      8.485281    5.656854   15.556349
             min     23.000000    2.000000   12.000000
             25%     26.000000    4.000000   17.500000
             50%     29.000000    6.000000   23.000000
             75%     32.000000    8.000000   28.500000
             max     35.000000   10.000000   34.000000

In [122]:
# Left Join, Right Join, Inner Join, Outer Join

# Merging, Joining and Concatenating

In [123]:
df1 = pd.DataFrame(
    {
        'A' : ['A0','A1','A2','A3'],
        'B' : ['B0','B1','B2','B3'],
        'C' : ['C0','C1','C2','C3'],
        'D' : ['D0','D1','D2','D3'],
    },
    index = [0,1,2,3]
)

In [124]:
df2 = pd.DataFrame(
    {
        'A' : ['A4','A5','A6','A7'],
        'B' : ['B4','B5','B6','B7'],
        'C' : ['C4','C5','C6','C7'],
        'D' : ['D4','D5','D6','D7'],
    },
    index = [4,5,6,7]
)

In [125]:
df3 = pd.DataFrame(
    {
        'A' : ['A8','A9','A10','A11'],
        'B' : ['B8','B9','B10','B11'],
        'C' : ['C8','C9','C10','C11'],
        'D' : ['D8','D9','D10','D11'],
    },
    index = [8,9,10,11]
)

In [126]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [127]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [128]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

In [129]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Joining

In [131]:
# Merge is column based, joining is row based.
left = pd.DataFrame(
    {
        'A' : ['A0','A1','A2',],
        'B' : ['B0','B1','B2',]
    },
    index = ['K1', 'K2' ,'K3']
)

In [132]:
left

     A   B
K1  A0  B0
K2  A1  B1
K3  A2  B2

In [135]:
df = pd.DataFrame(
    {
        'col1' : [1,2,3,4],
        'col2' : [444,555,666,444],
        'col3' : ['abc','def','ghi','xyz']
    }
)

In [136]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [140]:
df['col2'].nunique()

3

In [141]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [143]:
def time2(x):
    return x**2

In [146]:
# apply function to the dataframe
df['col1'].apply(time2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [147]:
df['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [148]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [149]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [150]:
del df['col1']

In [151]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [153]:
df.sort_values(by='col2',ascending=False)

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

## Data input and output

In [157]:
df =pd.read_excel(r'data\Excel_Sample.xlsx','Sheet1')

KeyError: "['Unnamed'] not found in axis"

### to input data from HTML
* conda install lxml
* conda install html5lib
* conda install BeautifulSoup4

In [159]:
df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [162]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"